Dataset/data_test/nomad-sn-wrk-mixed-c6525-25g-exp15-havail1-hori1-verti1-infi1-client-t8-c512-d30-R2000-N4
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=2000
Running 30s test @ http://10.10.1.2:8080
  8 threads and 512 connections
  Thread calibration: mean lat.: 0.684ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.709ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.744ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.695ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.728ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.683ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.723ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.679ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   636.65us  231.36us   1.34ms   71.68%
    Req/Sec   263.40    165.54   700.00     74.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  588.00us
 75.000%  779.00us
 90.000%    0.95ms
 99.000%    1.34ms
 99.900%    1.67ms
 99.990%    2.06ms
 99.999%    2.43ms
100.000%    2.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.279     0.000000            1         1.00
       0.394     0.100000         4011         1.11
       0.428     0.200000         7986         1.25
       0.463     0.300000        12031         1.43
       0.510     0.400000        15996         1.67
       0.588     0.500000        19965         2.00
       0.632     0.550000        21938         2.22
       0.672     0.600000        23938         2.50
       0.707     0.650000        25959         2.86
       0.741     0.700000        27949         3.33
       0.779     0.750000        29892         4.00
       0.801     0.775000        30925         4.44
       0.823     0.800000        31902         5.00
       0.847     0.825000        32895         5.71
       0.876     0.850000        33901         6.67
       0.908     0.875000        34872         8.00
       0.927     0.887500        35379         8.89
       0.947     0.900000        35887        10.00
       0.969     0.912500        36379        11.43
       0.996     0.925000        36880        13.33
       1.029     0.937500        37366        16.00
       1.045     0.943750        37615        17.78
       1.068     0.950000        37871        20.00
       1.091     0.956250        38116        22.86
       1.114     0.962500        38368        26.67
       1.143     0.968750        38608        32.00
       1.163     0.971875        38736        35.56
       1.184     0.975000        38857        40.00
       1.206     0.978125        38983        45.71
       1.230     0.981250        39108        53.33
       1.262     0.984375        39232        64.00
       1.278     0.985938        39299        71.11
       1.297     0.987500        39359        80.00
       1.321     0.989062        39418        91.43
       1.343     0.990625        39480       106.67
       1.372     0.992188        39545       128.00
       1.382     0.992969        39574       142.22
       1.399     0.993750        39604       160.00
       1.424     0.994531        39636       182.86
       1.449     0.995313        39667       213.33
       1.476     0.996094        39698       256.00
       1.490     0.996484        39715       284.44
       1.511     0.996875        39729       320.00
       1.538     0.997266        39745       365.71
       1.566     0.997656        39760       426.67
       1.586     0.998047        39776       512.00
       1.600     0.998242        39783       568.89
       1.619     0.998437        39792       640.00
       1.631     0.998633        39799       731.43
       1.661     0.998828        39807       853.33
       1.674     0.999023        39815      1024.00
       1.695     0.999121        39818      1137.78
       1.716     0.999219        39822      1280.00
       1.754     0.999316        39826      1462.86
       1.790     0.999414        39830      1706.67
       1.800     0.999512        39834      2048.00
       1.808     0.999561        39836      2275.56
       1.816     0.999609        39838      2560.00
       1.850     0.999658        39840      2925.71
       1.902     0.999707        39842      3413.33
       1.935     0.999756        39844      4096.00
       1.955     0.999780        39845      4551.11
       1.960     0.999805        39846      5120.00
       1.988     0.999829        39847      5851.43
       2.029     0.999854        39848      6826.67
       2.059     0.999878        39849      8192.00
       2.059     0.999890        39849      9102.22
       2.145     0.999902        39850     10240.00
       2.145     0.999915        39850     11702.86
       2.207     0.999927        39851     13653.33
       2.207     0.999939        39851     16384.00
       2.207     0.999945        39851     18204.44
       2.213     0.999951        39852     20480.00
       2.213     0.999957        39852     23405.71
       2.213     0.999963        39852     27306.67
       2.213     0.999969        39852     32768.00
       2.213     0.999973        39852     36408.89
       2.427     0.999976        39853     40960.00
       2.427     1.000000        39853          inf
#[Mean    =        0.637, StdDeviation   =        0.231]
#[Max     =        2.426, Total count    =        39853]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59706 requests in 30.01s, 11.33MB read
  Socket errors: connect 0, read 0, write 0, timeout 6
Requests/sec:   1989.55
Transfer/sec:    386.64KB